In [1]:
!conda list pandas

# packages in environment at /anaconda3:
#
# Name                    Version                   Build  Channel
pandas                    0.23.0           py36h1702cab_0

# 为何要使用 Pandas？
机器学习算法能取得最近的飞速发展，部分原因就是我们可以用大量数据训练算法。但是，对于数据来说，数量并不是唯一重要的方面，数据质量也同等重要。经常大型数据库并不能直接馈送到学习算法中。很多时候，大型数据集缺失值、存在离群值、不正确的值，等等…例如，如果数据存在大量丢失值或糟糕值，机器学习算法将无法达到很好的性能。因此，机器学习的重要一步是首先检查数据，通过进行一些基本的数据分析，确保数据很适合你的训练算法。这时候，Pandas 就派上用场了。Pandas Series 和 DataFrame 专门用于快速进行数据分析和操纵，并且使用起来灵活简单。以下是使 Pandas 成为出色的数据分析软件包的几个功能：

- 允许为行和列设定标签
- 可以针对时间序列数据计算滚动统计学指标
- 轻松地处理 NaN 值
- 能够将不同格式的数据加载到 DataFrame 中
- 可以将不同的数据集合并到一起
- 与 NumPy 和 Matplotlib 集成

因为这些原因以及其他原因，Pandas DataFrame 已经成为 Python 中最常用的数据分析 Pandas 对象之一。

# Pandas Series

Pandas series 是一个像数组一样的一维对象，可以存储很多类型的数据，例如数字或字符串。

Pandas Series 和 NumPy ndarray 之间的主要区别之一是你可以为 Pandas Series 中的每个元素分配索引标签。

换句话说，你可以为 Pandas Series 索引指定任何名称。

Pandas Series 和 NumPy ndarrays 之间的另一个明显区别是 Pandas Series 可以存储不同类型的数据。

### 创建一个 Pandas Series

你可以使用 pd.Series(data, index) 命令创建 Pandas Series，其中 index 是一个索引标签列表。

我们使用 Pandas Series 存储一个购物清单。我们将使用食品条目作为索引标签，使用购买数量作为数据。

In [1]:
import pandas as pd

groceries = pd.Series(data = [30, 6, 'Yes', 'No'], index = ['eggs', 'apples', 'milk', 'bread'])

groceries

eggs       30
apples      6
milk      Yes
bread      No
dtype: object

 Pandas Series 的显示方式为：第一列是索引，第二列是数据。注意，数据的索引不是从 0 到 3，而是采用我们设置的食品名称，即鸡蛋、苹果、等...此外注意，我们的 Pandas Series 中的数据既包括整数，又包括字符串。

# 属性

In [3]:
# We print some information about Groceries
print('Groceries has shape:', groceries.shape)
print('Groceries has dimension:', groceries.ndim)
print('Groceries has a total of', groceries.size, 'elements')

Groceries has shape: (4,)
Groceries has dimension: 1
Groceries has a total of 4 elements

单独输出 Pandas Series 的索引标签和数据。如果你不知道 Pandas Series 的索引标签是什么，这种方法就很有用。

In [4]:
# We print the index and data of Groceries
print('The data in Groceries is:', groceries.values)
print('The index of Groceries is:', groceries.index)

The data in Groceries is: [30 6 'Yes' 'No']
The index of Groceries is: Index(['eggs', 'apples', 'milk', 'bread'], dtype='object')

如果你处理的是非常庞大的 Pandas Series，并且不清楚是否存在某个索引标签，可以使用 in 命令检查是否存在该标签：

In [5]:
# We check whether bananas is a food item (an index) in Groceries
x = 'bananas' in groceries

# We check whether bread is a food item (an index) in Groceries
y = 'bread' in groceries

# We print the results
print('Is bananas an index label in Groceries:', x)
print('Is bread an index label in Groceries:', y)

Is bananas an index label in Groceries: False
Is bread an index label in Groceries: True

In [6]:
groceries

eggs       30
apples      6
milk      Yes
bread      No
dtype: object

## 访问和删除 Pandas Series 中的元素

Pandas Series 的一大优势是我们能够以很多不同的方式访问数据。

我们可以通过在方括号 [ ] 内添加索引标签或数字索引访问元素，就像访问 NumPy ndarray 中的元素一样。因为我们可以使用数字索引，因此可以使用正整数从 Series 的开头访问数据，或使用负整数从末尾访问。

因为我们可以通过多种方式访问元素，为了清晰地表明我们指代的是索引标签还是数字索引，
Pandas Series 提供了两个属性 .loc 和 .iloc，帮助我们清晰地表明指代哪种情况。

属性 .loc 表示 位置，用于明确表明我们使用的是标签索引。

属性 .iloc 表示整型位置，用于明确表明我们使用的是数字索引。我们来看一些示例：

### 访问

In [7]:
# We use a single index label
groceries['eggs']

30

In [8]:
# we can access multiple index labels
groceries[['milk','bread']]

milk     Yes
bread     No
dtype: object

In [10]:
# we use loc to access multiple index labels
groceries.loc[['eggs', 'apples']]

eggs      30
apples     6
dtype: object

In [11]:
# We use a single numerical index
groceries[0]

30

In [14]:
# We use a negative numerical index
groceries[[-1]]

bread    No
dtype: object

In [13]:
# # we use multiple numerical indices
groceries[[0,1]]

eggs      30
apples     6
dtype: object

In [15]:
#属性 .loc 表示 位置，用于明确表明我们使用的是标签索引。同样，属性 .iloc 表示整型位置，用于明确表明我们使用的是数字索引。
groceries.iloc[[2,3]]

milk     Yes
bread     No
dtype: object

In [13]:
groceries

eggs       30
apples      6
milk      Yes
bread      No
dtype: object

### 修改

In [16]:
# We change the number of eggs to 2
groceries['eggs'] = 2

In [17]:
# We display the changed grocery list
groceries

eggs        2
apples      6
milk      Yes
bread      No
dtype: object

### 删除

In [19]:
"""
可以使用 .drop() 方法删除 Pandas Series 中的条目。
Series.drop(label) 方法会从给定 Series 中删除给定的 label。

* 请注意，Series.drop(label) 方法不在原地地从 Series 中删除元素，
  即不会更改被修改的原始 Series。

"""

groceries.drop("apples")

eggs       2
milk     Yes
bread     No
dtype: object

In [20]:
groceries

eggs        2
apples      6
milk      Yes
bread      No
dtype: object

### 算术运算

Pandas Series 和单个数字之间的算术运算:

In [22]:
fruits = pd.Series(data = [10, 6, 3], 
                   index = ['apple','organes','bananas'])
fruits

apple      10
organes     6
bananas     3
dtype: int64

In [23]:
fruits +2

apple      12
organes     8
bananas     5
dtype: int64

In [24]:
fruits -2

apple      8
organes    4
bananas    1
dtype: int64

In [25]:
fruits *2

apple      20
organes    12
bananas     6
dtype: int64

In [27]:
fruits /2

apple      5.0
organes    3.0
bananas    1.5
dtype: float64

### 对 Pandas Series 中的所有元素应用 NumPy 中的数学函数，例如 sqrt(x)。

In [28]:
import numpy as np

fruits

apple      10
organes     6
bananas     3
dtype: int64

In [29]:
# EXP(X)
np.exp(fruits)

apple      22026.465795
organes      403.428793
bananas       20.085537
dtype: float64

In [30]:
# SQRT(X)
np.sqrt(fruits)

apple      3.162278
organes    2.449490
bananas    1.732051
dtype: float64

In [31]:
# We raise all elements of fruits to the power of 2
# POW(X,2)
np.power(fruits,2)

apple      100
organes     36
bananas      9
dtype: int64

### Pandas 还允许我们仅对 fruits 购物清单中的部分条目应用算术运算

In [62]:
fruits

apples     10
oranges     6
bananas     3
dtype: int64

In [63]:
# We add 2 only to the bananas

# Amount of bananas + 2 =
fruits['bananas'] +2

5

In [64]:
# We subtract 2 from apples

# Amount of apples - 2 = 
fruits.iloc[0] - 2

8

In [65]:
# We multiply apples and oranges by 2

# We double the amount of apples and oranges: 
fruits[['apples', 'oranges']] * 2

apples     20
oranges    12
dtype: int64

In [66]:
# We divide apples and oranges by 2

fruits.loc[['apples', 'oranges']] / 2

apples     5.0
oranges    3.0
dtype: float64

In [56]:
fruits / 2

apples     5.0
oranges    3.0
bananas    1.5
dtype: float64

In [57]:
fruits

apples     10
oranges     6
bananas     3
dtype: int64

In [60]:
groceries * 2

eggs           4
apples        12
milk      YesYes
bread       NoNo
dtype: object

可以看出，在上述示例中，我们乘以了 2，Pandas 使每个条目的数据翻倍，包括字符串。Pandas 能够这么操作是因为，乘法运算 * 对数字和字符串来说都可行。如果你要应用对数字有效但是对字符串无效的运算，例如 /，则会出错。如果 Pandas Series 中有混合类型的数据，确保对于所有的元素数据类型，这些算术运算都有效。

# Pandas DataFrame

Pandas DataFrames 是具有带标签的行和列的二维数据结构，可以存储很多类型的数据。如果你熟悉 Excel 的话，可以将 Pandas DataFrames 看做类似于电子表格。在接下来的课程中，我们将开始学习如何手动地通过字典创建 Pandas DataFrame，稍后，我们将学习如何将数据文件中的数据加载到 DataFrame 中。

首先，我们将使用 Pandas Series 字典手动创建一个 DataFrame。第一步是创建 Pandas Series 字典。字典创建完毕后，我们可以将该字典传递给 pd.DataFrame() 函数。

我们将创建一个字典，其中包含 Alice 和 Bob 从在线商店中购买的商品。该 Pandas Series 将使用所买商品的价格作为数据，所买商品作为索引标签。我们来看看如何编写代码：

In [67]:
items = {'Bob' : pd.Series(data = [245, 25, 55], index = ['bike', 'pants', 'watch']),
         'c' : pd.Series(data = [40, 110, 500, 45], index = ['book', 'glasses', 'bike', 'pants'])}

In [68]:
items

{'Bob': bike     245
 pants     25
 watch     55
 dtype: int64, 'c': book        40
 glasses    110
 bike       500
 pants       45
 dtype: int64}

In [70]:
print(type(items))

<class 'dict'>

字典已经创建完毕，我们可以通过将其传递给 pd.DataFrame() 函数，创建 DataFrame。

我们将创建一个可以表示多位用户的购物车的 DataFrame，

In [71]:
items['Bob']

bike     245
pants     25
watch     55
dtype: int64

In [72]:
# We create a Pandas DataFrame by passing it a dictionary of Pandas Series
shopping_carts = pd.DataFrame(items)

# We display the DataFrame
shopping_carts

           Bob      c
bike     245.0  500.0
book       NaN   40.0
glasses    NaN  110.0
pants     25.0   45.0
watch     55.0    NaN

有几个事项需要注意:

- DataFrame 以表格形式显示，和 Excel 电子表格很像，行和列的标签以粗体形式显示。

- DataFrame 的行标签根据构建字典所用的两个 Pandas Series 的索引标签创建而成。DataFrame 的列标签来自字典的键。
另一个注意事项是，`列按照字母顺序排序，而不是字典中的顺序`。

- 当我们从数据文件中向 DataFrame 加载数据时，不会发生这种情况。
- 该 DataFrame 中出现了一些 NaN 值。

`NaN` 是指非数字，Pandas 通过这种方式表示该行和列索引没有值。

例如，如果我们查看 Alice 列，我们发现手表索引的值是 NaN。你可以通过查看一开始创建的字典，了解为何是这种情况。
可以清晰地看出，Alice 手表标签没有条目。因此，在创建 DataFrame 时，如果特定行索引的特定列没有值，Pandas 将用 NaN 值填充。


如果要将此数据馈送到机器学习算法中，我们首先需要删掉这些 NaN 值。

In [85]:
# 我们使用具有定义清晰的索引的 Pandas Series 字典创建了 Pandas DataFrame。如果我们不向 Pandas Series 提供索引标签，Pandas 在创建 DataFrame 时将使用数字行索引。

# We create a dictionary of Pandas Series without indexes
data = {'Bob' : pd.Series([245, 25, 55]),
        'Alice' : pd.Series([40, 110, 500, 45])}

# We create a DataFrame
df = pd.DataFrame(data)

# We display the DataFrame
df

     Bob  Alice
0  245.0     40
1   25.0    110
2   55.0    500
3    NaN     45

# 属性

Pandas DataFrame 的行索引从 0 开始，就像 NumPy ndarray 的索引一样。

In [74]:
# shape
shopping_carts.shape

(5, 2)

In [75]:
# dimension
shopping_carts.ndim

2

In [76]:
# a total of elements
shopping_carts.size

10

In [77]:
# The data
shopping_carts.values

array([[245., 500.],
       [ nan,  40.],
       [ nan, 110.],
       [ 25.,  45.],
       [ 55.,  nan]])

In [86]:
# The row index
shopping_carts.index

Index(['bike', 'book', 'glasses', 'pants', 'watch'], dtype='object')

In [87]:
# The column index 
shopping_carts.columns

Index(['Bob', 'c'], dtype='object')

在 shopping_carts DataFrame 时，我们将整个字典传递给了 pd.DataFrame() 函数。但是，有时候你可能只对一部分数据感兴趣。在 Pandas 中，我们可以通过关键字 columns 和 index 选择要将哪些数据放入 DataFrame 中。我们来看一些示例：

In [88]:
# We Create a DataFrame that only has Bob's data
bob_shopping_cart = pd.DataFrame(items, columns=['Bob'])

# We display bob_shopping_cart
bob_shopping_cart

       Bob
bike   245
pants   25
watch   55

In [94]:
# We Create a DataFrame that only has selected items for both Alice and Bob
sel_shopping_cart = pd.DataFrame(items, index = ['pants', 'book'])

# We display sel_shopping_cart
sel_shopping_cart

        Bob   c
pants  25.0  45
book    NaN  40

In [95]:
# We Create a DataFrame that only has selected items for Alice
alice_sel_shopping_cart = pd.DataFrame(items, index = ['glasses', 'bike'], columns = ['Alice'])

# We display alice_sel_shopping_cart
alice_sel_shopping_cart

        Alice
glasses   NaN
bike      NaN

你还可以使用列表（数组）字典手动地创建 DataFrame。流程和之前一样，首先创建一个字典，然后将该字典传递给 pd.DataFrame() 函数。但是在这种情况下，字典中的所有列表（数组）长度必须一样。我们来看一个示例：

In [96]:
# We create a dictionary of lists (arrays)
data = {'Integers' : [1,2,3],
        'Floats' : [4.5, 8.2, 9.6]}

# We create a DataFrame 
df = pd.DataFrame(data)

# We display the DataFrame
df

   Integers  Floats
0         1     4.5
1         2     8.2
2         3     9.6

注意，因为我们创建的 data 字典没有标签索引，因此 Pandas 在创建 DataFrame 时自动使用数字行索引。但是，我们可以通过在 pd.DataFrame() 函数中使用关键字 index，为行索引添加标签。我们来看一个示例：

In [97]:
# We create a dictionary of lists (arrays)
data = {'Integers' : [1,2,3],
        'Floats' : [4.5, 8.2, 9.6]}

# We create a DataFrame and provide the row index
df = pd.DataFrame(data, index = ['label 1', 'label 2', 'label 3'])

# We display the DataFrame
df

         Integers  Floats
label 1         1     4.5
label 2         2     8.2
label 3         3     9.6

手动创建 Pandas DataFrame 的最后一种方式是使用 Python 字典列表。

流程和之前一样，我们先创建字典，然后将该字典传递给 pd.DataFrame() 函数。

In [115]:
# We create a list of Python dictionaries
items2 = [{'bikes': 20, 'pants': 30, 'watches': 35}, 
          {'watches': 10, 'glasses': 50, 'bikes': 15, 'pants':5}]

# We create a DataFrame 
store_items = pd.DataFrame(items2)

# We display the DataFrame
store_items

   bikes  glasses  pants  watches
0     20      NaN     30       35
1     15     50.0      5       10

同样注意，因为我们创建的 items2 字典没有标签索引，因此 Pandas 在创建 DataFrame 时自动使用数字行索引。

和之前一样，我们可以通过在 pd.DataFrame() 函数中使用关键字 index，为行索引添加标签。

假设我们将使用该 DataFrame 存储某个商店的商品库存数量。我们将行索引的标签设为 store 1 和 store 2。

In [116]:
# We create a list of Python dictionaries
items2 = [{'bikes': 20, 'pants': 30, 'watches': 35}, 
          {'watches': 10, 'glasses': 50, 'bikes': 15, 'pants':5}]

# We create a DataFrame  and provide the row index
store_items = pd.DataFrame(items2, index = ['store 1', 'store 2'])

# We display the DataFrame
store_items

         bikes  glasses  pants  watches
store 1     20      NaN     30       35
store 2     15     50.0      5       10

# 访问 Pandas DataFrame 中的元素

通过多种不同的方式访问 Pandas DataFrame 中的元素。

通常，我们可以使用行和列标签访问 DataFrame 的行、列或单个元素。

我们将使用在上节课创建的同一 store_items DataFrame。我们来看一些示例：

In [117]:
store_items

         bikes  glasses  pants  watches
store 1     20      NaN     30       35
store 2     15     50.0      5       10

In [118]:
# We access rows, columns and elements using labels

store_items[['bikes']]

         bikes
store 1     20
store 2     15

In [119]:
store_items[['bikes', 'pants']]

         bikes  pants
store 1     20     30
store 2     15      5

In [120]:
store_items.loc[['store 1']]

         bikes  glasses  pants  watches
store 1     20      NaN     30       35

In [121]:
store_items['bikes']['store 2']

15

请注意，在访问 DataFrame 中的单个元素时，就像上个示例一样:
`必须始终提供标签，并且列标签在前，格式为 dataframe[column][row]。`

例如，在检索商店 2 中的自行车数量时，我们首先使用列标签 bikes，然后使用行标签 store 2。如果先提供行标签，将出错。

我们还可以通过`添加行或列修改 DataFrame`。

我们先了解如何向 DataFrame 中添加新的列。假设我们想添加每个商店的衬衫库存。

为此，我们需要向 store_items DataFrame 添加一个新列，表示每个商店的衬衫库存。我们来编写代码：

In [122]:
# We add a new column named shirts to our store_items DataFrame indicating the number of shirts in stock at each store. We
# will put 15 shirts in store 1 and 2 shirts in store 2
store_items['shirts'] = [15,2]

# We display the modified DataFrame
store_items

         bikes  glasses  pants  watches  shirts
store 1     20      NaN     30       35      15
store 2     15     50.0      5       10       2

当我们添加新的列时，新列添加到了 DataFrame 的末尾。

还可以使用算术运算符向 DataFrame 中的其他列之间添加新列。我们来看一个示例：

In [123]:
# We make a new column called suits by adding the number of shirts and pants
store_items['suits'] = store_items['pants'] + store_items['shirts']

# We display the modified DataFrame
store_items

         bikes  glasses  pants  watches  shirts  suits
store 1     20      NaN     30       35      15     45
store 2     15     50.0      5       10       2      7

假设现在你开了一家新店，需要将该商店的商品库存添加到 DataFrame 中。

为此，我们可以向 store_items Dataframe 中添加一个新行。

要向 DataFrame 中`添加行`，我们首先需要`创建新的 Dataframe`，然后`将其附加到原始 DataFrame 上`。

我们来看看代码编写方式

In [124]:
# We create a dictionary from a list of Python dictionaries that will number of items at the new store
new_items = [{'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4}]

# We create new DataFrame with the new_items and provide and index labeled store 3
new_store = pd.DataFrame(new_items, index = ['store 3'])

# We display the items at the new store
new_store

         bikes  glasses  pants  watches
store 3     20        4     30       35

现在，我们使用 `.append()` 方法将此行添加到 store_items DataFrame 中。

In [125]:
# We append store 3 to our store_items DataFrame
store_items = store_items.append(new_store, sort=True)

# We display the modified DataFrame
store_items

         bikes  glasses  pants  shirts  suits  watches
store 1     20      NaN     30    15.0   45.0       35
store 2     15     50.0      5     2.0    7.0       10
store 3     20      4.0     30     NaN    NaN       35

注意，将新行附加到 DataFrame 后，列按照字母顺序排序了。

我们还可以`仅使用特定列的特定行中的数据向 DataFrame 添加新的列`。


例如，假设你想在商店 2 和 3 中上一批新手表，并且新手表的数量与这些商店原有手表的库存一样。我们来看看如何编写代码

In [126]:
# We add a new column using data from particular rows in the watches column
store_items['new watches'] = store_items['watches'][1:]

# We display the modified DataFrame
store_items

         bikes  glasses  pants  shirts  suits  watches  new watches
store 1     20      NaN     30    15.0   45.0       35          NaN
store 2     15     50.0      5     2.0    7.0       10         10.0
store 3     20      4.0     30     NaN    NaN       35         35.0

我们还可以`将新列插入 DataFrames 的任何位置`。

** dataframe.insert(loc,label,data)** 方法使我们能够将新列（具有给定列标签和给定数据）插入 dataframe 的 **loc** 位置。


我们将名称为 shoes 的新列插入 suits 列前面。因为 suits 的数字索引值为 4，我们将此值作为 loc。


我们来看看代码编写方式:

In [127]:
# We insert a new column with label shoes right before the column with numerical index 4
store_items.insert(4, 'shoes', [8,5,0])

# we display the modified DataFrame
store_items

         bikes  glasses  pants  shirts  shoes  suits  watches  new watches
store 1     20      NaN     30    15.0      8   45.0       35          NaN
store 2     15     50.0      5     2.0      5    7.0       10         10.0
store 3     20      4.0     30     NaN      0    NaN       35         35.0

### 删除

就像我们可以添加行和列一样，我们也可以`删除`它们。

要删除 DataFrame 中的行和列，我们将使用 **.pop()** 和 **.drop()** 方法。
- .pop() 方法仅允许我们删除列
- .drop() 方法可以同时用于删除行和列，只需使用关键字 axis 即可。

我们来看一些示例：

In [128]:
# We remove the new watches column
store_items.pop('new watches')

# we display the modified DataFrame
store_items

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20      NaN     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     NaN      0    NaN       35

In [129]:
# We remove the watches and shoes columns
store_items = store_items.drop(['watches', 'shoes'], axis = 1)

# we display the modified DataFrame
store_items

         bikes  glasses  pants  shirts  suits
store 1     20      NaN     30    15.0   45.0
store 2     15     50.0      5     2.0    7.0
store 3     20      4.0     30     NaN    NaN

In [130]:
# We remove the store 2 and store 1 rows
store_items = store_items.drop(['store 2', 'store 1'], axis = 0)

# we display the modified DataFrame
store_items

         bikes  glasses  pants  shirts  suits
store 3     20      4.0     30     NaN    NaN

有时候，我们可能需要更`改行和列标签`。我们使用 **.rename() **方法将 bikes 列标签改为 hats

In [131]:
# We change the column label bikes to hats
store_items = store_items.rename(columns = {'bikes': 'hats'})

# we display the modified DataFrame
store_items

         hats  glasses  pants  shirts  suits
store 3    20      4.0     30     NaN    NaN

现在再次使用 .rename() 方法更改行标签。

In [132]:
# We change the row label from store 3 to last store
store_items = store_items.rename(index = {'store 3': 'last store'})

# we display the modified DataFrame
store_items

            hats  glasses  pants  shirts  suits
last store    20      4.0     30     NaN    NaN

你还可以将索引改为 DataFrame 中的某个列。

In [133]:
# We change the row index to be the data in the pants column
store_items = store_items.set_index('pants')

# we display the modified DataFrame
store_items

       hats  glasses  shirts  suits
pants
30       20      4.0     NaN    NaN

# 处理 NaN

正如之前提到的，在能够使用大型数据集训练学习算法之前，我们通常需要先清理数据。

也就是说，我们需要通过某个方法检测并更正数据中的错误。
虽然任何给定数据集可能会出现各种糟糕的数据，例如离群值或不正确的值，但是我们几乎始终会遇到的糟糕数据类型是缺少值。
正如之前看到的，Pandas 会为缺少的值分配 NaN 值。在这节课，我们将`学习如何检测和处理 NaN 值`

In [134]:
# 首先，我们将创建一个具有一些 NaN 值的 DataFrame。

# We create a list of Python dictionaries
items2 = [{'bikes': 20, 'pants': 30, 'watches': 35, 'shirts': 15, 'shoes':8, 'suits':45},
{'watches': 10, 'glasses': 50, 'bikes': 15, 'pants':5, 'shirts': 2, 'shoes':5, 'suits':7},
{'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4, 'shoes':10}]

# We create a DataFrame  and provide the row index
store_items = pd.DataFrame(items2, index = ['store 1', 'store 2', 'store 3'])

# We display the DataFrame
store_items

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20      NaN     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     NaN     10    NaN       35

可以清晰地看出，我们创建的 DataFrame 具有 3 个 **NaN** 值：

商店 1 中有一个，商店 3 中有两个。但是，如果我们向 DataFrame 中加载非常庞大的数据集，可能有数百万条数据，那么就不太容易直观地发现 NaN 值的数量。

对于这些情形，我们结合使用多种方法来计算数据中的 NaN 值的数量。

以下示例同时使用了 **.isnull()** 和 **sum()** 方法来计算我们的 DataFrame 中的 NaN 值的数量。

In [135]:
# We count the number of NaN values in store_items
x =  store_items.isnull().sum().sum()

# We print x
print('Number of NaN values in our DataFrame:', x)

Number of NaN values in our DataFrame: 3

在上述示例中，`.isnull()` 方法返回一个大小和 store_items 一样的布尔型 DataFrame，

并用 True 表示具有 NaN 值的元素，用 False 表示非 NaN 值的元素。
我们来看一个示例：

In [136]:
store_items.isnull()

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1  False     True  False   False  False  False    False
store 2  False    False  False   False  False  False    False
store 3  False    False  False    True  False   True    False

在 Pandas 中，逻辑值 True 的数字值是 1，逻辑值 False 的数字值是 0。

因此，我们可以通过数逻辑值 True 的数量数出 NaN 值的数量。 

为了数逻辑值 True 的总数，我们使用 **.sum()** 方法两次。

要使用该方法两次，是因为`第一个 sum() 返回一个 Pandas Series，其中存储了列上的逻辑值 True 的总数`，如下所示：

In [137]:
store_items.isnull().sum()

bikes      0
glasses    1
pants      0
shirts     1
shoes      0
suits      1
watches    0
dtype: int64

第二个 **sum()** 将上述 Pandas Series 中的 1 相加。

除了数 `NaN` 值的数量之外，我们还可以采用相反的方式，我们可以数非 NaN 值的数量。

为此，我们可以使用 `.count()` 方法，如下所示：

In [138]:
# We print the number of non-NaN values in our DataFrame
print('Number of non-NaN values in the columns of our DataFrame:\n', store_items.count())

Number of non-NaN values in the columns of our DataFrame:
 bikes      3
glasses    2
pants      3
shirts     2
shoes      3
suits      2
watches    3
dtype: int64

现在我们已经知道如何判断数据集中是否有任何 `NaN` 值，下一步是决定如何处理这些 NaN 值。

通常，我们有两种选择，可以删除或替换 `NaN` 值。在下面的示例中，我们将介绍这两种方式。

### .dropna()

首先，我们将学习如何从 DataFrame 中删除包含任何 `NaN` 值的行或列。

- 如果 `axis = 0`，`.dropna(axis)` 方法将删除包含 `NaN` 值的任何行，
- 如果 `axis = 1`，`.dropna(axis)` 方法将删除包含 `NaN` 值的任何列。

我们来看一些示例：

In [139]:
store_items

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20      NaN     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     NaN     10    NaN       35

In [140]:
# We drop any rows with NaN values
store_items.dropna(axis = 0)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 2     15     50.0      5     2.0      5    7.0       10

In [141]:
# We drop any columns with NaN values
store_items.dropna(axis = 1)

         bikes  pants  shoes  watches
store 1     20     30      8       35
store 2     15      5      5       10
store 3     20     30     10       35

# .fillna()

注意，`.dropna()` 方法不在原地地删除具有 `NaN`值的行或列。

也就是说，原始 DataFrame 不会改变。

你始终可以在 dropna() 方法中将关键字 `inplace` 设为 `True`，在原地删除目标行或列。

现在，我们不再删除 NaN 值，而是将它们替换为合适的值。


例如，我们可以选择将所有 NaN 值替换为 0。为此，我们可以使用 **.fillna()** 方法，如下所示。

In [142]:
# We replace all NaN values with 0
store_items.fillna(0)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20      0.0     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     0.0     10    0.0       35

我们还可以使用 .fillna() 方法将 NaN 值替换为 DataFrame 中的上个值，称之**为前向填充**。


在通过前向填充替换 NaN 值时，我们可以使用列或行中的上个值。

`.fillna(method = 'ffill', axis)` 将通过前向填充 (`ffill`) 方法沿着给定 `axis` 使用上个已知值替换 `NaN` 值。

我们来看一些示例：

In [143]:
# We replace NaN values with the previous value in the column
store_items.fillna(method = 'ffill', axis = 0)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20      NaN     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     2.0     10    7.0       35

注意 store 3 中的两个 NaN 值被替换成了它们所在列中的上个值。

但是注意， store 1 中的 NaN 值没有被替换掉。

因为这列前面没有值，因为 NaN 值是该列的第一个值。

但是，如果使用上个行值进行前向填充，则不会发生这种情况。我们来看看具体情形：

In [144]:
# We replace NaN values with the previous value in the row
store_items.fillna(method = 'ffill', axis = 1)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1   20.0     20.0   30.0    15.0    8.0   45.0     35.0
store 2   15.0     50.0    5.0     2.0    5.0    7.0     10.0
store 3   20.0      4.0   30.0    30.0   10.0   10.0     35.0

我们看到，在这种情形下，所有 NaN 值都被替换成了之前的行值。

同样，你可以选择用 DataFrame 中之后的值替换 NaN 值，称之为**后向填充**。

`.fillna(method = 'backfill', axis)` 将通过后向填充 (`backfill`) 方法沿着给定 `axis` 使用下个已知值替换 NaN 值。

和前向填充一样，我们可以选择使用行值或列值。我们来看一些示例：

In [145]:
# We replace NaN values with the next value in the column
store_items.fillna(method = 'backfill', axis = 0)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20     50.0     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     NaN     10    NaN       35

注意，store 1 中的 `NaN` 值被替换成了它所在列的下个值。
但是注意，store 3 中的两个 `NaN` 值没有被替换掉。

因为这些列中没有下个值，这些 `NaN` 值是这些列中的最后一个值。

但是，如果使用**下个行值进行后向填充**，则不会发生这种情况。我们来看看具体情形：

In [146]:
# We replace NaN values with the next value in the row
store_items.fillna(method = 'backfill', axis = 1)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1   20.0     30.0   30.0    15.0    8.0   45.0     35.0
store 2   15.0     50.0    5.0     2.0    5.0    7.0     10.0
store 3   20.0      4.0   30.0    10.0   10.0   35.0     35.0

注意，`.fillna()`方法不在原地地替换（填充）NaN 值。
也就是说，原始 DataFrame 不会改变。
你始终可以在 `fillna()` 函数中将关键字 `inplace` 设为 `True`，在原地替换 `NaN` 值。


我们还可以选择使用不同的插值方法替换 `NaN` 值。

例如，`.interpolate(method = 'linear', axis)`方法将通过 `linear` 插值使用沿着给定 axis 的值替换 NaN 值。

我们来看一些示例：

In [147]:
# We replace NaN values by using linear interpolation using column values
store_items.interpolate(method = 'linear', axis = 0)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20      NaN     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     2.0     10    7.0       35

注意，store 3 中的两个 `NaN` 值被替换成了线性插值。但是注意，store 1 中的 `NaN` 值没有被替换掉。

因为该 NaN 值是该列中的第一个值，因为它前面没有数据，因此插值函数无法计算值。现在，我们使用行值插入值：

In [148]:
# We replace NaN values by using linear interpolation using row values
store_items.interpolate(method = 'linear', axis = 1)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1   20.0     25.0   30.0    15.0    8.0   45.0     35.0
store 2   15.0     50.0    5.0     2.0    5.0    7.0     10.0
store 3   20.0      4.0   30.0    20.0   10.0   22.5     35.0

和我们看到的其他方法一样，`.interpolate()` 方法不在原地地替换 NaN 值。

## 测试

In [150]:
import pandas as pd
import numpy as np

pd.set_option('precision', 1)

books = pd.Series(data = ['Great Expectations', 'Of Mice and Men', 'Romeo and Juliet', 'The Time Machine', 'Alice in Wonderland' ])
authors = pd.Series(data = ['Charles Dickens', 'John Steinbeck', 'William Shakespeare', ' H. G. Wells', 'Lewis Carroll' ])
user_1 = pd.Series(data = [3.2, np.nan ,2.5])
user_2 = pd.Series(data = [5., 1.3, 4.0, 3.8])
user_3 = pd.Series(data = [2.0, 2.3, np.nan, 4])
user_4 = pd.Series(data = [4, 3.5, 4, 5, 4.2])

dat = {'Book Title' : books,
       'Author' : authors,
       'User 1' : user_1,
       'User 2' : user_2,
       'User 3' : user_3,
       'User 4' : user_4}

book_ratings = pd.DataFrame(dat)

book_ratings.fillna(book_ratings.mean(), inplace = True)

book_ratings

            Book Title               Author  User 1  User 2  User 3  User 4
0   Great Expectations      Charles Dickens     3.2     5.0     2.0     4.0
1      Of Mice and Men       John Steinbeck     2.9     1.3     2.3     3.5
2     Romeo and Juliet  William Shakespeare     2.5     4.0     2.8     4.0
3     The Time Machine          H. G. Wells     2.9     3.8     4.0     5.0
4  Alice in Wonderland        Lewis Carroll     2.9     3.5     2.8     4.2

# 将数据加载到 Pandas DataFrame 中

在机器学习中，你很有可能会使用来自很多来源的数据库训练学习算法。Pandas 使我们能够将不同格式的数据库加载到 DataFrame 中。

用于存储数据库的最热门数据格式是 csv。CSV 是指逗号分隔值，是一种简单的数据存储格式。

我们可以使用 `pd.read_csv() `函数将 CSV 文件加载到 Pandas DataFrame 中。

我们将 Google 股票数据加载到一个 Pandas DataFrame 中。

GOOG.csv 文件包含从雅虎金融那获取的 2004 年 8 月 19 日至 2017 年 10 月 13 日 Google 股票数据

In [152]:
# 我们将 Google 股票数据加载到 DataFrame 中
Google_stock = pd.read_csv('./GOOG.csv')

# 我们输出关于 Google_stock 的一些信息
print('Google_stock is of type:', type(Google_stock))
print('Google_stock has shape:', Google_stock.shape)

Google_stock is of type: <class 'pandas.core.frame.DataFrame'>
Google_stock has shape: (3313, 7)

可以看出，我们将 GOOG.csv 文件加载到了 Pandas DataFrame 中，其中包含 3,313 行和 7 列数据。

现在我们来看看股票数据:

In [153]:
Google_stock

            Date   Open   High    Low  Close  Adj Close    Volume
0     2004-08-19   49.7   51.7   47.7   49.8       49.8  44994500
1     2004-08-20   50.2   54.2   49.9   53.8       53.8  23005800
2     2004-08-23   55.0   56.4   54.2   54.3       54.3  18393200
3     2004-08-24   55.3   55.4   51.5   52.1       52.1  15361800
4     2004-08-25   52.1   53.7   51.6   52.7       52.7   9257400
5     2004-08-26   52.1   53.6   52.0   53.6       53.6   7148200
6     2004-08-27   53.7   54.0   52.5   52.7       52.7   6258300
7     2004-08-30   52.3   52.4   50.7   50.7       50.7   5235700
8     2004-08-31   50.8   51.5   50.7   50.9       50.9   4954800
9     2004-09-01   51.0   51.2   49.5   49.8       49.8   9206800
10    2004-09-02   49.3   50.9   49.2   50.4       50.4  15232100
11    2004-09-03   50.1   50.5   49.3   49.7       49.7   5191000
12    2004-09-07   50.2   50.7   49.5   50.5       50.5   5891300
13    2004-09-08   50.0   51.2   49.9   50.8       50.8   5023000
14    2004-09-09   50.9   51.0   50.2   50.8       50.8   4092100
15    2004-09-10   50.5   52.9   50.3   52.3       52.3   8764200
16    2004-09-13   53.0   53.9   52.9   53.4       53.4   7902900
17    2004-09-14   53.4   55.6   53.0   55.4       55.4  10910200
18    2004-09-15   54.9   56.7   54.7   55.6       55.6  10793500
19    2004-09-16   55.8   57.5   55.5   56.6       56.6   9335800
20    2004-09-17   56.8   58.4   56.4   58.4       58.4   9543500
21    2004-09-20   58.1   60.4   58.0   59.3       59.3  10708500
22    2004-09-21   59.5   59.8   58.4   58.5       58.5   7282900
23    2004-09-22   58.3   59.4   58.0   58.8       58.8   7638000
24    2004-09-23   59.0   60.9   58.1   60.0       60.0   8599600
25    2004-09-24   60.1   61.6   59.5   59.5       59.5   9191900
26    2004-09-27   59.4   60.0   58.5   58.7       58.7   7119100
27    2004-09-28   60.3   63.3   59.7   63.0       63.0  17056100
28    2004-09-29   62.9   67.1   62.7   65.1       65.1  30745600
29    2004-09-30   64.5   65.7   64.1   64.4       64.4  13861300
...          ...    ...    ...    ...    ...        ...       ...
3283  2017-09-01  941.1  942.5  935.2  937.3      937.3    947400
3284  2017-09-05  933.1  937.0  922.0  928.5      928.5   1326400
3285  2017-09-06  930.2  930.9  919.3  927.8      927.8   1527700
3286  2017-09-07  931.7  936.4  923.6  936.0      936.0   1212700
3287  2017-09-08  936.5  937.0  924.9  926.5      926.5   1011500
3288  2017-09-11  934.2  938.4  926.9  929.1      929.1   1267000
3289  2017-09-12  932.6  933.5  923.9  932.1      932.1   1134400
3290  2017-09-13  930.7  937.2  929.9  935.1      935.1   1102600
3291  2017-09-14  931.2  932.8  924.0  925.1      925.1   1397600
3292  2017-09-15  924.7  926.5  916.4  920.3      920.3   2505400
3293  2017-09-18  920.0  922.1  910.6  915.0      915.0   1306900
3294  2017-09-19  917.4  922.4  912.5  921.8      921.8    936700
3295  2017-09-20  923.0  933.9  922.0  931.6      931.6   1669800
3296  2017-09-21  933.0  936.5  923.8  932.5      932.5   1290600
3297  2017-09-22  927.8  934.7  926.5  928.5      928.5   1052700
3298  2017-09-25  925.5  926.4  909.7  921.0      921.0   1856800
3299  2017-09-26  923.7  930.8  921.1  924.9      924.9   1666900
3300  2017-09-27  927.7  949.9  927.7  944.5      944.5   2239400
3301  2017-09-28  941.4  950.7  940.5  949.5      949.5   1020300
3302  2017-09-29  952.0  959.8  951.5  959.1      959.1   1581000
3303  2017-10-02  960.0  962.5  947.8  953.3      953.3   1283400
3304  2017-10-03  954.0  958.0  949.1  957.8      957.8    888300
3305  2017-10-04  957.0  960.4  950.7  951.7      951.7    952400
3306  2017-10-05  955.5  970.9  955.2  970.0      970.0   1213800
3307  2017-10-06  966.7  979.5  963.4  978.9      978.9   1173900
3308  2017-10-09  980.0  985.4  976.1  977.0      977.0    891400
3309  2017-10-10  980.0  981.6  966.1  972.6      972.6    968400
3310  2017-10-11  973.7  990.7  972.2  989.2      989.2   1693300
3311  2017-10-12  987.5  994.1  985.0  987.8      987.8   1262400
3312  2017-10-13  992.0  997.2  989.0  989.7      989.7   1157700

[3313 rows x 7 columns]

可以看出，这是一个非常庞大的数据集，Pandas 自动为该 DataFrame 分配了数字行索引。

Pandas 还使用出现在 CSV 文件中的标签为列分配标签。


在处理这样的大型数据集时，通常有必要直接查看前几行数据，而不是整个数据集。

我们可以使用 .head() 方法查看前 5 行数据，如下所示

In [155]:
Google_stock.head()

         Date  Open  High   Low  Close  Adj Close    Volume
0  2004-08-19  49.7  51.7  47.7   49.8       49.8  44994500
1  2004-08-20  50.2  54.2  49.9   53.8       53.8  23005800
2  2004-08-23  55.0  56.4  54.2   54.3       54.3  18393200
3  2004-08-24  55.3  55.4  51.5   52.1       52.1  15361800
4  2004-08-25  52.1  53.7  51.6   52.7       52.7   9257400

In [156]:
# 我们还可以使用 .tail() 方法查看最后 5 行数据：
Google_stock.tail()

            Date   Open   High    Low  Close  Adj Close   Volume
3308  2017-10-09  980.0  985.4  976.1  977.0      977.0   891400
3309  2017-10-10  980.0  981.6  966.1  972.6      972.6   968400
3310  2017-10-11  973.7  990.7  972.2  989.2      989.2  1693300
3311  2017-10-12  987.5  994.1  985.0  987.8      987.8  1262400
3312  2017-10-13  992.0  997.2  989.0  989.7      989.7  1157700

我们还可以选择使用 `.head(N)` 或 `.tail(N)` 分别显示前 N 行和后 N 行数据。

我们快速检查下数据集中是否有任何 `NaN` 值。
为此，我们将使用 `.isnull()` 方法，然后是 `.any()` 方法，检查是否有任何列包含 NaN 值。

In [157]:
Google_stock.isnull().any()

Date         False
Open         False
High         False
Low          False
Close        False
Adj Close    False
Volume       False
dtype: bool

可以看出没有任何 `NaN` 值。

在处理大型数据集时，通常有必要获取关于数据集的统计信息。

通过使用 Pandas 的 `.describe()` 方法，可以获取关于 DataFrame 每列的描述性统计信息。

我们来看看代码编写方式：

In [158]:
# We get descriptive statistics on our stock data
Google_stock.describe()

         Open    High     Low   Close  Adj Close   Volume
count  3313.0  3313.0  3313.0  3313.0     3313.0  3.3e+03
mean    380.2   383.5   376.5   380.1      380.1  8.0e+06
std     223.8   225.0   222.5   223.9      223.9  8.4e+06
min      49.3    50.5    47.7    49.7       49.7  7.9e+03
25%     226.6   228.4   224.0   226.4      226.4  2.6e+06
50%     293.3   295.4   289.9   293.0      293.0  5.3e+06
75%     536.7   540.0   532.4   536.7      536.7  1.1e+07
max     992.0   997.2   989.0   989.7      989.7  8.3e+07

In [159]:
"""

如果有必要，我们可以对单列应用 .describe() 方法，如下所示：

"""
# We get descriptive statistics on a single column of our DataFrame
Google_stock['Adj Close'].describe()

count    3313.0
mean      380.1
std       223.9
min        49.7
25%       226.4
50%       293.0
75%       536.7
max       989.7
Name: Adj Close, dtype: float64

In [161]:
"""
也可使用 Pandas 提供的很多统计学函数查看某个统计信息。我们来看一些示例：
"""
# Maximum values 
Google_stock.max()

Date         2017-10-13
Open              1e+03
High              1e+03
Low               1e+03
Close             1e+03
Adj Close         1e+03
Volume         82768100
dtype: object

In [162]:
# Minimum Close value 
Google_stock['Close'].min()

49.681866

In [163]:
# Average value of each column
Google_stock.mean()

Open         3.8e+02
High         3.8e+02
Low          3.8e+02
Close        3.8e+02
Adj Close    3.8e+02
Volume       8.0e+06
dtype: float64

另一个重要统计学衡量指标是**数据相关性**。数据相关性可以告诉我们不同列的数据是否有关联。

我们可以使用 `.corr()` 方法获取不同列之间的关联性，如下所示：

In [164]:
# We display the correlation between columns
Google_stock.corr()

           Open  High  Low  Close  Adj Close  Volume
Open        1.0   1.0  1.0    1.0        1.0    -0.6
High        1.0   1.0  1.0    1.0        1.0    -0.6
Low         1.0   1.0  1.0    1.0        1.0    -0.6
Close       1.0   1.0  1.0    1.0        1.0    -0.6
Adj Close   1.0   1.0  1.0    1.0        1.0    -0.6
Volume     -0.6  -0.6 -0.6   -0.6       -0.6     1.0

关联性值为 1 表明关联性很高，关联性值为 0 告诉我们数据根本不相关。

## .groupby()

.groupby() 方法使我们能够以不同的方式对数据分组。

我们来看看如何分组数据，以获得不同类型的信息。在下面的示例中，我们将加载关于虚拟公司的虚拟数据。

In [165]:
# We load fake Company data in a DataFrame
data = pd.read_csv('./fake_company.csv')

data

FileNotFoundError: File b'./fake_company.csv' does not exist